x = int(input('Введите число от 0 до 99:'));
y = ["ноль","один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять",
"десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать",
"шестнадцать", "семнадцать", "восемнадцать", "девятнадцать", "двадцать"
, "тридцать" , "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
ten = x // 10 + 18
one = x % 10
if (x >= 0) and (x <= 99):
    if x <= 20:
        print(y[x])
    elif (x >= 21) and (one != 0):
        print(y[ten], y[one])
    else:
        print(y[ten])
else: print("Число должно быть в промежутке от 0 до 99")